{
    "Portfolio": [
        {
            "name": "JavaScript DailyDev Problems",
            "img": "Images/jsDailyDev.PNG",
            "description": "A React multipage frontend to showcase my JavaScript coding abilities by completing the code problems on the <a href='https://daily.dev/blog/fun-coding-problems-from-easy-to-hard' target='_blank' id='dailyDev'>DailyDev</a> website.",
            "link": "https://github.com/AtlasRB/javaScriptDailyDevProblems",
            "livelink": "https://jsdailydev.2024-connory.dev.io-academy.uk",
            "largeDescription": "Built using a multipage React frontend, this project is intended to work through all of DailyDev code problems in the JavaScript language. The home layout is designed to be horizontally scrolled to view different problems."
        },
        {
            "name": "Card Collection",
            "img": "Images/individualCardCollection.PNG",
            "description": "A React frontend displaying gen one pokemon cards with multiple filter types.",
            "link": "https://github.com/AtlasRB/Card-Collections",
            "livelink": "https://cardcollection.2024-connory.dev.io-academy.uk",
            "largeDescription": "Built using a React frontend to fetch a database containing generation one pokemon along with additional information about each. This data is then displayed in a table format styled using Tailwind CSS."
        },
        {
            "name": "Card Collection API",
            "img": "Images/individualCardCollectionAPI.PNG",
            "description": "The backend API for Card Collection project built the PHP Laravel framework.",
            "link": "https://github.com/AtlasRB/Card-Collections-API",
            "livelink": "https://cardcollector.2024-connory.dev.io-academy.uk/api/card",
            "largeDescription": "This project shows use of multiple methods such as GET, POST, PUT and DELETE. Testing is also used in this project."
        },
        {
            "name": "Skylander Sypros Adventure Collection Site",
            "img": "Images/skylanderLaravel.PNG",
            "description": "A site built using the PHP Laravel framework, the site is used to track collected Skylander Spyros Adventure figures.",
            "link": "https://github.com/AtlasRB/skylanderLaravelProject",
            "livelink": "https://skylandercollectors.2024-connory.dev.io-academy.uk",
            "largeDescription": "Built with Laravel using Laravel Breeze this project teaches multiple new skills that I had not attempted in previous projects. This project is an advanced version of my card collection project, users can create their own account and then track their own collectables."
        }
    ]
}